notepad.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
<soapenv:Header  xmlns="http://www.sample.com/authentication">
    <appId>nnf-sister-ngo</appId>
    <secret>1424hkh4242h4qe243h234</secret>
</soapenv:Header>
<soapenv:Body>
<getNNFPaymentConfig xmlns="http://www.sample.com/nnf-payment-config">
    <amount>434</amount>
    <cancellationUrl>https://google.com</cancellationUrl>
    <returnUrl>https://facebook.com</returnUrl>
</getNNFPaymentConfig>
</soapenv:Body>
</soapenv:Envelope>

sdfsdf

controller
<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;
use Illuminate\Support\Facades\Log;

class CountryController extends Controller
{
    public function getSoapRequest(Request $request)
    {
        $xmlData = $request->getContent();

        /**
         * convert request into something we can work with
         */
        $xml = simplexml_load_string($xmlData, NULL, NULL, "http://schemas.xmlsoap.org/soap/envelope/");

        /**
         * register your used namespace prefixes
         */
        $xml->registerXPathNamespace('soap-env', 'http://schemas.xmlsoap.org/soap/envelope/');
        $xml->registerXPathNamespace('payment-config', 'http://www.sample.com/nnf-payment-config'); // ? ns not in use
        $xml->registerXPathNamespace('authentication', 'http://www.sample.com/authentication'); // ? ns not in use

        /**
         * setup authentication variables
         */
        $secret = (string) $xml->xpath('/soapenv:Envelope/soapenv:Header/authentication:secret')[0];
        $appId = (string) $xml->xpath('/soapenv:Envelope/soapenv:Header/authentication:appId')[0];

        /**
         * setup transaction variables we need to make a request to hubtel
         */
        $amount = (float) $xml->xpath('/soapenv:Envelope/soapenv:Body/payment-config:getNNFPaymentConfig/payment-config:amount')[0];
        $cancellationUrl = (string) $xml->xpath('/soapenv:Envelope/soapenv:Body/payment-config:getNNFPaymentConfig/payment-config:cancellationUrl')[0];
        $returnUrl = (string) $xml->xpath('/soapenv:Envelope/soapenv:Body/payment-config:getNNFPaymentConfig/payment-config:returnUrl')[0];

        Log::debug($appId);
        Log::debug($secret);
        Log::debug($amount);
        Log::debug($cancellationUrl);
        Log::debug($returnUrl);
    }
}


profile update
- profile picture
- basic information
- location
- skills
- languages
